app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = 3 LIMIT 1
---
  def signedinuserprofile
    profile = Profile.find_by_user_id(current_user.id)

INSERT INTO "profiles" ("address", "created_at", "firstname", "lastname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["address", "48 Liffey Park"], ["created_at", "2014-12-13 14:18:42.354943"], ["firstname", "Ryan"], ["lastname", "Lacerna"], ["updated_at", "2014-12-13 14:18:42.354943"], ["user_id", 3]]
---
  def create
    @profile = Profile.new(profile_params)
    @profile.save